EDT/УТ/src/Documents/упрПлатежноеПоручение/упрПлатежноеПоручение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>упрПлатежноеПоручение</name>
  <attributes>
    <name>ЗаписьРасхода</name>
    <type>
      <types>DocumentRef.упрЗаписьРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежаМаксимальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхБазы1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПП_БП</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПП_БП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/упрСостоянияПлатежей/упрСостоянияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>упрСостоянияПлатежей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеПлатежа</name>
    <type>
      <types>EnumRef.упрСостоянияПлатежей</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.упрЗагрузкаДанныхОПлатежахИзБП</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Платеж</name>
    <type>
      <types>DocumentRef.упрПлатежноеПоручение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/упрПлатежноеПоручение/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	Если Не Объект.Ссылка.Пустая() тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	упрСостоянияПлатежейСрезПоследних.СостояниеПлатежа КАК СостояниеПлатежа
		|ИЗ
		|	РегистрСведений.упрСостоянияПлатежей.СрезПоследних(, Платеж = &Ссылка) КАК упрСостоянияПлатежейСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		СостояниеПлатежа = Выборка.СостояниеПлатежа;
	КонецЕсли;
	
	СтрИдентификаторПП_БП = Объект.ИдентификаторПП_БП;
	
КонецПроцедуры
